# 8.4
# Создайте следующий словарь: ключи – BMW, Tesla;
# значения – список из 3х моделей.
# Выведите 1ое и последнее значения каждого из ключей.

car_1 = "BMW"
model_1 = "M5", "i8", "X4"
car_2 = "Tesla"
model_2 = "Cybertruck", "Roadster", "Model_Y"
d = {car_1: model_1, car_2: model_2}
print(d)
